{"wav": "podcast/testdata/recording_1.wav", "transcript": "I remember I was not disciplined at all in terms of my eating and my fitness. I mean, I can't even relate to that guy anymore that I was in those years, you know. So I had played IPL from 2008, 9, 10, 11, and then 12 IPL. 12 was I, I was playing for India. I was playing for the national team at the highest level, but I hadn't got the success, you know, that some of the established players did. And IPL 2012 again, had a really, really bad IPL season and my eating habits were horrible in that season. Very, very bad. And I can remember coming back home and I came out of the shower, the team didn't do well. I came out of the shower, I looked my, looked at myself in the mirror and I was like, that's the time it hit me, you know, and, and luckily everything that's, that's been bad in me somehow I get that calling myself that you need to get it right. Like there hardly anyone coming and telling me, you know, you're really messing up. It just comes from within. And then I saw myself in the mirror and I was like, you can't look like that if you're an international cricketer, you know, I was like, how the hell are you going to continue like this if you don't take care of yourself? Boom. From next day onwards, I just changed everything about my diet. Hitting the gym two hours a day, just taking a day off in a week, eating proper lean food. I got away from all kinds of, you know, junk. I did not have a cheat day at all. And within eight to 10 months, I, I lost about six or seven kgs. And then from then on, it became such an addiction because I saw the results on the field, I felt quicker, I felt lighter, felt more focused. And then I was like, man, this is the path I want to walk. It was before all of this happened. This was when I played for the country and then I was left out. And for 13 months I wasn't selected again. And then it became sort of a madness that I want to get back up, I want to get back into the team. And then, you know, those, those 13 months I was like, I was so focused. I was so focused that I want to get back, I want to get back into the team. And my performances were such that the selectors could not ignore me after a while. So eventually I got my chance again and luckily I've never been out of the team since. This was actually 20, end of 2011, 2012, actually when we came back from Australia and I figured out the difference or the gap that we have with other countries. And I thought, if we don't change the way we are playing or I don't change the way I'm playing or the way I'm training or thinking or eating, I can never be among the best players in the world. And there's no point in just competing if you don't want to be the best. So I wanted to be the best version of myself. And then I based everything around that vision. And then my training, my diet, my approach towards the game, everything changed. And I know that I wasn't the most skilled sports person when I came in, but the only thing that's been constant is working hard on myself and my game. And that was the time I realized, well, if the Indian team has to be the best team in the world, we need to go ahead in a certain manner. I didn't feel that when I walked into play there was any kind of fear or respect in the opposition corner. So I felt like I don't want to walk into the field thinking or the opposition thinking this is just a pushover. Don't worry about this guy, he's going to do no damage to us and he's just playing just like another player in the team and stuff. I wanted to make an impact. I knew that I have the ability to make my team win and I wanted to be that version of myself where if I walk in, I wanted teams to think like, we need to get this guy out or else we're going to lose the game. So I thought, if I can't have that impact on my team, then I'm not doing justice to where I am. And if I don't want to be that guy, there's something wrong in my head. Either I've accepted being lower than what I should be, or I just don't have enough drive in me. So I said, I'm going to unlock my max potential and achieve what I should be.", "speaker": "speaker1", "duration": 4.25}
{"wav": "podcast/testdata/recording_2.wav", "transcript": "It happened in 2012, played the IPL in 2012. And the lead up to that was interesting because I had scored my first Test 100 in Australia in 2012, followed by that game against Sri Lanka in Hobart where we chased that total down within 40 overs. That came out of nowhere. Honestly, I did not believe that I could do something like that at the international stage. It happened, gave me so much belief from there. And then it Asia cup came and I got 183 against Pakistan on a Sunday. Everyone was watching. So things really just turned in about six months for me. But I forgot the basics of the game. I started, you know, becoming more desperate and I thought, this ipl, I'm going to dominate everyone. But you know, the moment IPL started a few games which didn't go my way, and my mindset completely dropped to the other end. I was eating anything that came in sight. I was finishing, you know, candy packets, 40 pieces a packet. I would finish three packets a week. I was eating horribly, sleeping horribly. My habits were all over the place. And I finished ipl. I remember I went home, came out of the shower first day, and I saw myself in the mirror and I was ashamed. It was literally I saw myself and I thought, I'm looking at another human being. And I told myself, look, if you want to play cricket at the highest level, this is not the way that you can manage. And from next day onwards, I changed everything about my diet, the way I trained, everything. And from then on, it was just an obsession. Look, when I step onto the field, I have to believe that I'm the best. Because my mindset, as I said, was very clear from, from the first time I started playing this game. I'm not going to allow anyone to, to think that I'm just a pushover. So my mindset was, I'm going to go to Australia and how am I going to score runs against these guys? I wasn't going out there to survive. And from the time I got back home till the Australia tour, I promise you, I was visualizing every day when I was working out in the gym that I'm hitting Mitchell Johnson, I'm hitting these guys all over the park. And those things came to life eventually because I convinced myself to an extent when I went there, I was absolutely fearless and things just started flowing. To be honest, before that Australia tour, I was treating every foreign tool like, you know, more like an engineering exam that I have to pass somehow and I have to show people that I can play at this level. But there I realized that, you know, once, once you're down and out. There was hardly anyone who came to help me. There was hardly anyone who was looking towards me and saying, listen, let's, let's work together and, you know, try to get your game up to speed. Everyone was just going after me left, right and center. So I was like, am I playing to prove these people wrong? For what? I've got nothing to do with them and they literally have nothing to contribute in my life. So I went back home, I was down for quite a bit. The great thing that happened at that stage was I realized who's with me, who's not. You know, things were filtered to an extent that I just got so relaxed when I went back home, I was like, okay, I've hit rock bottom now. No one believes in me. Everyone thinks I should not be playing Test cricket. So what can I do? I can just work as hard as I can. For me, one thing was always and always very clear. When I step onto the field, I'm going to give 120% every game that I play. And one thing for a fact, that no one can count that against me. Till the time I play this game, I am going to play this way. And this is who I am. And if my mindset in the field is simple, I will not stand around wanting people to do something that I'm not able to do first. For me, every ball is an event. Every moment is an opportunity to make your team win. And that is exactly why you step onto the field. You have to make that time count. If you told me I had to walk away from this game tomorrow, I can walk away without any regrets. Because everything that I've done since I entered the Indian cricket team has always been for the team. I've been booed by 40, 50,000 people regularly when I enter the stadium. If I start focusing on those 50,000, I can't play a ball. For me, that's an opportunity. That's an opportunity for me to say, okay, fine, things are stacked up against me. Let me test myself how good I am. There always have been two options for me. Either it's fight or flight. And I've never taken flight. Or flight. I've never taken flight. For me, that's just not. Because, look, I can take flight. If I can't sleep peacefully at night, for me, it's not worth it. I might as well take the fight. If I fail, I know that I took the right option. And that gives me peace. For me, when I leave the field, as I just Said I need to be able to know that I've given everything I had and I sleep like a baby. There is nothing else that can distract me then, because in my potential as a human being, God has blessed me with a healthy mind, healthy body, an opportunity which, you know, everyone wants. So I have to be honest to that. I have to live up to that. So for me, these things are just a, just a process, just a part of the process, which is you keep moving forward, you keep taking the positive option. Whether you get success or not, that's irrelevant. But never take a backward step. Face, face the fear, look it in the eye and say, fine, I'm gonna have a smile on my face and I'm gonna, I'm gonna keep coming at you. And that's, that's how I live my life as well. I don't live my life half and half. I've never done something which I'm not hundred percent convinced about. So for me, as I said, if you wanted me to walk away now, I'd have zero regrets in life or in cricket. But this culture is what is more dear to me. And I will do everything in my ability. Even if we lose a Test match, I want us to go for the win and not surrender or try to save a Test match on day three or day four. That for me, just not acceptable. So for me, as I said, milestones don't matter at all. If I had played for milestones in my career, I probably wouldn't have half of what I have right now. So my mindset is pretty clear. And for us, it's just pursuit of excellence. It.", "speaker": "speaker2", "duration": 5.48}
